//==================================================================================
//注：所有脚本开头，均需注明本脚本的大致说明文字
//
//
//所有Npc随机对话脚本，客户端
//$NpcRandomDialog[%NpcID,1] = "XXX";

$NpcRandomDialog[444444444,1] = "吃饭旅行，走走停停。";
//蓬莱新手村npc对话

$NpcRandomDialog[410100001,1] = "道可道，非常道;名可名，非常名。";
$NpcRandomDialog[410100001,2] = "无名天地之始。有名万物之母。故常无欲以观其妙。常有欲以观其徼。";
$NpcRandomDialog[410100002,1] = "侠士记住啦，好的器具是要经过千锤百炼才能制作出来的";
$NpcRandomDialog[410100003,1] = "炼丹可是个考验耐性的活，需要七七四十九天才能淬炼成丹！";
$NpcRandomDialog[410100004,1] = "侠士，要记住在成长的道路上不可急功近利！";
$NpcRandomDialog[410100005,1] = "一分耕耘一份收获，我们还会再见面的";
$NpcRandomDialog[410100006,1] = "师傅刚带我上山的时候，这里还没有招收其他弟子呢！";
$NpcRandomDialog[410100007,1] = "没有扎实的基本功，行走江湖会被人欺负的！";
$NpcRandomDialog[410100008,1] = "小师弟别怕，有事情师姐帮你摆平！";
$NpcRandomDialog[410100009,1] = "别看我是个弱女子，我法术可不比他们差！";
$NpcRandomDialog[410100010,1] = "为民除害是每位侠士义不容辞的责任，望早日修成正果！";
$NpcRandomDialog[410100011,1] = "守卫禁地是我的职责，有我在这妖怪休想逃出危害百姓";
$NpcRandomDialog[410100012,1] = "哎，鱼越来越难捕捞了，都是这些精怪在作祟！！！";
$NpcRandomDialog[410100012,2] = "侠士再不除掉这些精怪，恐怕村民们都有性命危险啦！";
$NpcRandomDialog[410100013,1] = "咳.咳.咳！！侠士带上我吧，我也想为民除害！";
$NpcRandomDialog[410100014,1] = "君子成人之美，不成人之恶，小人反是。";
$NpcRandomDialog[410100015,1] = "您一定没见过像我这样漂亮可爱的孔雀吧！";
$NpcRandomDialog[410100016,1] = "不是所有人都能叫狂人的哦，精益求精才是王道！";
$NpcRandomDialog[410100017,1] = "侠士总算来啦！小钰在这等你很久了。";
$NpcRandomDialog[410100018,1] = "在村里我可是出了名的热心肠哦，有困难直接找我就行了";
$NpcRandomDialog[410100019,1] = "大家都叫我旺财，我在仙界可是有一定声望的哦！";
$NpcRandomDialog[410100020,1] = "我这里有各种精美的物品，侠士有什么需要的么？";
$NpcRandomDialog[410100023,1] = "非淡泊无以明志,非宁静无以致远!";
$NpcRandomDialog[410100024,1] = "虽然我修为尚浅，但是我也有行侠仗义之心";
$NpcRandomDialog[410100025,1] = "你们千万别伤着我们可爱的小师妹";
$NpcRandomDialog[410100026,1] = "昆仑有很多好玩的地方呢，要我带你去玩么？";
$NpcRandomDialog[410100027,1] = "侠士需要布匹么，我这里有很多哦，便宜又好看！";
$NpcRandomDialog[410100028,1] = "听闻侠士远道而来，有什么需要帮助的么？";
$NpcRandomDialog[410100029,1] = "嗨！就叫我小彤吧。";
$NpcRandomDialog[410100031,1] = "侠士们快来！这里有师傅为你们准备的奖励哦^_^";
$NpcRandomDialog[410100050,1] = "非淡泊无以明志,非宁静无以致远!";
$NpcRandomDialog[410100051,1] = "各位侠士们想去哪里，我送你们一程吧！";
$NpcRandomDialog[410100052,1] = "快来我这看看你们又收到了哪些新邮件吧！";
$NpcRandomDialog[410100053,1] = "老夫夜观天象，可能要有大事发生了！";
$NpcRandomDialog[410100054,1] = "咱们这么有缘，不如交个朋友吧！";
$NpcRandomDialog[410100055,1] = "勿以恶小而为之，勿以善小而不为！";
$NpcRandomDialog[410100056,1] = "天降大任于斯人也,必先苦其心志、劳其筋骨！";
$NpcRandomDialog[410100058,1] = "来这里就对了，我应该是这里最受欢迎的人了！";
$NpcRandomDialog[410100059,1] = "关于制器方面的知识，我可以跟你说上三天三夜！";
$NpcRandomDialog[410100060,1] = "修行的道理上符咒是不可或缺的！";
$NpcRandomDialog[410100062,1] = "赏罚分明才是我的风格！";
$NpcRandomDialog[410100064,1] = "每周日晚17：00-19：00记得来这里限量兑换心法秘笈！";
$NpcRandomDialog[ 410100065, 1 ] = "这大海之中不知道有多少奇珍异宝！";
$NpcRandomDialog[ 410100066, 1 ] = "王婆卖瓜，自卖自夸！";
$NpcRandomDialog[ 410100067, 1 ] = "俺从小都是村子里力气最大的。";


//昆仑主城npc对话

$NpcRandomDialog[410010001,1] = "移将北斗过南辰，两手双擎日月轮；飞趁昆仑山上去，须臾化作一天云。";
$NpcRandomDialog[410010002,1] = "你们不要挑战少城主的威严！";
$NpcRandomDialog[410010003,1] = "我随城主来这里已有百余年之久了！";
$NpcRandomDialog[410010004,1] = "但使龙城飞将在,不教胡马度阴山！";
$NpcRandomDialog[410010005,1] = "将军百战死,壮士十年归！";
$NpcRandomDialog[410010006,1] = "兵者，诡道也。故能而示之不能，用而示之不用";
$NpcRandomDialog[410010009,1] = "清风徐来，水波不兴，还算有诗意吧！";
$NpcRandomDialog[410010010,1] = "我是明月，明月的明，明月的月!";
$NpcRandomDialog[410010011,1] = "天机不可泄露，万物自有定数！";
$NpcRandomDialog[410010012,1] = "我可不是你们眼中娇生惯养的大小姐，我有颗行侠仗义的心!";
$NpcRandomDialog[410010101,1] = "嗨！我这里提供一流的隐私保密服务，请放心存储您的物品吧！";
$NpcRandomDialog[410010102,1] = "快来我这看看你们又收到了哪些新邮件吧！";
$NpcRandomDialog[410010103,1] = "你们想去哪里呢，我送你们一程吧！";
$NpcRandomDialog[410010104,1] = "水滴石穿，铁杵成针，只要毅力在，自然能成就一番事业！";
$NpcRandomDialog[410010105,1] = "搜罗天下珍品，我这没有的，其他地方自然也不会有！";
$NpcRandomDialog[410010106,1] = "我们专注钱庄三十年，只为提供更好的服务！";
$NpcRandomDialog[410010107,1] = "帮会是一家，记得互帮互助哦！";
$NpcRandomDialog[410010108,1] = "侠士们快来这里领取你的礼品吧！";
$NpcRandomDialog[410010110,1] = "财来财来";
$NpcRandomDialog[410010111,1] = "这里可都是上好的货源！";
$NpcRandomDialog[410010112,1] = "看看告示牌上都写了些什么吧！";
$NpcRandomDialog[410010113,1] = "福到运到！这里有你们喜欢的双倍经验哦！";
$NpcRandomDialog[410010114,1] = "听到孟婆二字，你们都只想到了孟婆汤！不过这里只提供删除账号服务！";
$NpcRandomDialog[410010115,1] = "论医术，在下自认与华佗不相上下，你们觉得呢？";
$NpcRandomDialog[410010116,1] = "在下一生与剑为伴，可否愿意坐下来听我诉说一二！";
$NpcRandomDialog[410010117,1] = "我可是昆仑界最好的裁缝！";
$NpcRandomDialog[410010118,1] = "看看吧，这里有各种精美的饰品哦！";
$NpcRandomDialog[410010119,1] = "书中自有颜如玉，书中自有黄金屋，有了技能书你会更强！";
$NpcRandomDialog[410010120,1] = "快让我瞧瞧这都是些什么宝贝！";
$NpcRandomDialog[410010121,1] = "每一次强化都是一次新的提升，侠士准备好了么？";
$NpcRandomDialog[410010122,1] = "我来帮你鉴定一下你的物品吧，说不定有意外惊喜呢！";
$NpcRandomDialog[410010123,1] = "红宝石、绿宝石、蓝宝石，哪个宝石才是你的最爱呢？";
$NpcRandomDialog[410010129,1] = "鬼斧神工，大概这个词说的就是我吧！";
$NpcRandomDialog[410010130,1] = "你很荣幸，华佗确实在世！";
$NpcRandomDialog[410010131,1] = "巧夺天工的作品，我已经有很多了，还是低调点的好!";
$NpcRandomDialog[410010132,1] = "凭我的厨艺没什么能难道我的！";
$NpcRandomDialog[410010133,1] = "哈哈哈，你可能对符咒一无所知，要不要让我来教你制作？";
$NpcRandomDialog[410010134,1] = "试拂铁衣如雪色,聊持宝剑动星文！";
$NpcRandomDialog[410010135,1] = "浮云游子意,落日故人情！";
$NpcRandomDialog[410010136,1] = "有人问我修行法，遥指天边日月轮！";
$NpcRandomDialog[410010137,1] = "道袍薜带应慵挂，隐帽皮冠尚懒簪！";
$NpcRandomDialog[410010138,1] = "你说的是弓箭手么，哇听起来很酷！";
$NpcRandomDialog[410010140,1] = "虽然厨艺比不上厨神，但是我的厨艺也很棒的哦！";
$NpcRandomDialog[410010141,1] = "走，我带你去试炼一下，或许你会很感激我的！";
$NpcRandomDialog[410010201,1] = "快看看有哪些精彩的活动等你！";
$NpcRandomDialog[410010202,1] = "重温老酒友来迟，案上黑棋等客知；昨夜高山流水曲，分明三月柳飞堤。！";
$NpcRandomDialog[410010205,1] = "上古宝藏重现世间，静待有缘人将它发掘！";
$NpcRandomDialog[410010208,1] = "你可知各位仙家在哪？";
$NpcRandomDialog[410010213,1] = "攻城略地，展现雄心伟业的时候到了！";
$NpcRandomDialog[410010214,1] = "江山社稷，一统昆仑，多少侠士的梦想！";
$NpcRandomDialog[410010216,1] = "江山代有才人出，各领风骚数百年！";

$NpcRandomDialog[410010142,1] = "这个世界上，没有我修不好的装备。";

$NpcRandomDialog[410010143,1] = "你知道我哥哥嘛？他是最好的炼器师。";
$NpcRandomDialog[410010143,1] = "哥哥一定会成为天下第一炼器师。";
//望仙谷npc对话

$NpcRandomDialog[411010001,1] = "此处有神仙居住，使这里的草药蕴含仙灵之气，都是上等之宝！";
$NpcRandomDialog[411010002,1] = "哎，山上的柴都不敢去砍了，山头都被妖怪给占据着！";
$NpcRandomDialog[411010003,1] = "这里的鱼可都是宝贝啊，味道好极了！";
$NpcRandomDialog[411010004,1] = "要是再年轻几岁我也要跟着你们去斩妖除魔！";
$NpcRandomDialog[411010005,1] = "带我去玩好么？我想出去玩玩！";
$NpcRandomDialog[411010006,1] = "老啦，真的老啦，走路都有点困难了！";
$NpcRandomDialog[411010007,1] = "这里的野兽怪物特别多，侠士们小心点！";
$NpcRandomDialog[411010008,1] = "各位侠士们想去哪里，我送你们一程吧！";
$NpcRandomDialog[411010009,1] = "可能您又收到新的邮件了，快来瞧瞧吧！";
$NpcRandomDialog[411010010,1] = "有付出就有回报，可能有时候会有那么一点运气成分哦！";
$NpcRandomDialog[411010011,1] = "哎，小师妹也不知道跑哪里去了！";
$NpcRandomDialog[411010012,1] = "保卫光明是我的神圣职责！";
$NpcRandomDialog[411010013,1] = "我在此守护已经千年了，何时才是个头！";
$NpcRandomDialog[411010014,1] = "这里盛产灵药，熬出的汤药功效奇佳！";
$NpcRandomDialog[411010015,1] = "我造出的剑，我说第二谁敢说第一？";
$NpcRandomDialog[411010016,1] = "侠士来看看吧，店铺虽小，可能有你适合的物品哦！";
$NpcRandomDialog[411010017,1] = "这里有上好的布匹，侠士要来点么？";
$NpcRandomDialog[411010018,1] = "人是铁饭是刚。就算你们是修仙的，这也是必备品吧！";
$NpcRandomDialog[411010019,1] = "我这里有很多精美的饰品哦，要不要来看一看呀。";
$NpcRandomDialog[411010020,1] = "你我既能相遇，那便是缘分。";
$NpcRandomDialog[411010021,1] = "隐士之道，唯有能忍。";
$NpcRandomDialog[411010022,1] = "落花有意，流水无痕。";

//------------1102苍山雪海-----------
$NpcRandomDialog[411020001,1] = "各位侠士们想去哪里，我送你们一程吧！";
$NpcRandomDialog[411020002,1] = "可能您又收到新的邮件了，快来瞧瞧吧！";
$NpcRandomDialog[411020003,1] = "有付出就有回报，可能有时候会有那么一点运气成分哦!";
$NpcRandomDialog[411020004,1] = "    ";
$NpcRandomDialog[411020005,1] = "这里盛产灵药，熬出的汤药功效奇佳！";
$NpcRandomDialog[411020006,1] = "我造出的剑，我说第二谁敢说第一？";
$NpcRandomDialog[411020007,1] = "侠士来看看吧，店铺虽小，可能有你适合的物品哦！";
$NpcRandomDialog[411020008,1] = "这里有上好的布匹，侠士要来点么？";
$NpcRandomDialog[411020009,1] = "人是铁饭是刚。就算你们是修仙的，这也是必备品吧！";
$NpcRandomDialog[411020010,1] = "哎，我家的小丫头又不知道跑哪里去了";
$NpcRandomDialog[411020011,1] = "运筹帷幄之中，决胜千里之外";
$NpcRandomDialog[411020013,1] = "有我在，这里绝对安全";
$NpcRandomDialog[411020014,1] = "我这里有很多精美的饰品哦，要不要来看一看呀。";
$NpcRandomDialog[411020015,1] = "这是哪里呀？我怎么又迷路了";
$NpcRandomDialog[411020019,1] = "咱白虎寨的客卿，那可真是既聪明又漂亮！";
$NpcRandomDialog[411020020,1] = "在此看守封剑台真是无聊，我都快要打瞌睡了";
$NpcRandomDialog[411020021,1] = "此处天寒地冻，我为何还要拿一把扇子？";

//-----------1103云梦泽------------
$NpcRandomDialog[411030001,1] = "你看我像不像可爱的花仙子呢";
$NpcRandomDialog[411030002,1] = "云梦泽地产富饶，遍地都是灵药";
$NpcRandomDialog[411030003,1] = "我这里有很多精美的饰品哦，要不要来看一看呀。";
$NpcRandomDialog[411030004,1] = "有付出就有回报，可能有时候会有那么一点运气成分哦!";
$NpcRandomDialog[411030005,1] = "    ";
$NpcRandomDialog[411030006,1] = "这里盛产灵药，熬出的汤药功效奇佳！";
$NpcRandomDialog[411030007,1] = "我造出的剑，我说第二谁敢说第一？";
$NpcRandomDialog[411030008,1] = "各位侠士们想去哪里，我送你们一程吧！";
$NpcRandomDialog[411030009,1] = "可能您又收到新的邮件了，快来瞧瞧吧！";
$NpcRandomDialog[411030010,1] = "侠士来看看吧，店铺虽小，可能有你适合的物品哦！";
$NpcRandomDialog[411030011,1] = "这里有上好的布匹，制作装备必不可少哦。";
$NpcRandomDialog[411030012,1] = "此处的鱼儿甚是美味呢";
$NpcRandomDialog[411030013,1] = "想要来偷灵泉水？你问过我的弓箭了吗";
$NpcRandomDialog[411030014,1] = "海生万物，如今海底被暴君龙王称霸，十分凶险";
$NpcRandomDialog[411030015,1] = "    ";
$NpcRandomDialog[411030016,1] = "    ";
$NpcRandomDialog[411030017,1] = "    ";

$NpcRandomDialog[411200004, 1] = "传说中，九转金丹是最难炼的丹药。";
$NpcRandomDialog[411200004, 2] = "炼丹之道，博大精深，不止奇植异草可炼丹，妖兽身上也有不少灵材异宝。";
$NpcRandomDialog[411210004, 1] = "传说中，九转金丹是最难炼的丹药。";
$NpcRandomDialog[411210004, 2] = "炼丹之道，博大精深，不止奇植异草可炼丹，妖兽身上也有不少灵材异宝。";
$NpcRandomDialog[411220004, 1] = "传说中，九转金丹是最难炼的丹药。";
$NpcRandomDialog[411220004, 2] = "炼丹之道，博大精深，不止奇植异草可炼丹，妖兽身上也有不少灵材异宝。";

$NpcRandomDialog[411200005,1] = "这位修士是否想回昆仑修整一番？";
$NpcRandomDialog[411210005,1] = "这位修士是否想回昆仑修整一番？";
$NpcRandomDialog[411220005,1] = "这位修士是否想回昆仑修整一番？";

