//==================================================================================
//注：所有脚本开头，均需注明本脚本的大致说明文字
//
//
//客户端任务对话，【章回任务】
//==================================================================================
//function MissionxxxxxDialog( %Npc, %Player, %Mid, %Tid )//通用任务基础模板
//{
//	//echo( "%Tid ==" @ %Tid );
//	switch ( %Tid )
//	{
//
//		case 10001:	return "<t>废话</t><b/>"; //任务目标
//		case 10002:	return "<t>废话</t><b/>"; //接任务对白
//		case 10005:	return "<t>废话</t><b/>"; //任务完成时对白
//
//		case 20001:return "<t></t><b/>";//接任务前NPC的废话
//		case 21001:return "<t></t><b/>";//接任务前玩家的废话
//
//		case 30001:return "<t>1</t><b/>";//交任务前NPC的废话
//		case 31001:return "<t>1</t><b/>";//交任务前玩家的废话
//
//		case 30002:return "<t>2</t><b/>";//交任务前NPC的废话
//		case 31002:return "<t>2</t><b/>";//交任务前玩家的废话
//	}
//	if ( %Tid <= 20000 || %Tid >= 40000 )
//		return "Mission" @ %Mid @ "Dialog == 错误 Npc 【" @ %Npc @ "】Player【" @ %Player @ "】Mid【" @ %Mid @ "】Tid【" @ %Tid @ "】";
//	else
//		return "";
//}