//==================================================================================
//注：所有脚本开头，均需注明本脚本的大致说明文字
//
//
//应对临时更新的脚本，用于替换线上错误的函数，可以直接起效而不需要关闭服务端
//
//==================================================================================

//快速跳转入口，选中后使用F3即可，如果你不是用UE，那就帮不了你了

//■■■■■■■■■■■以下内容为修复功能，永久存在■■■■■■■■■■■■■■■■
//■■■■■■■■■■■以下内容为临时修复，更新版本后删除■■■■■■■■■■■■■
//■■■■■■■■■■■Npc对话中加入在线修复对白■■■■■■■■■
//■■■■■■■■■■■角色登录Or切换线程Or切换地图修复BUG■■■■


//■■■■■■■■■■■以下内容为修复功能，永久存在■■■■■■■■■■■■■■■■

//■■■■■■■■■■■Npc对话中加入在线修复对白■■■■■■■■■
function Npc_Hotfix_Opition(%Npc,%Player,%State,%Conv)
{

}
//■■■■■■■■■■■Npc对话中加入在线修复对白■■■■■■■■■


//■■■■■■■■■■■角色登录Or切换线程Or切换地图修复BUG■■■■
function  Hotfix_Login_SwitchLine_Transport(%Type,%Player)
{

}
//■■■■■■■■■■■角色登录Or切换线程Or切换地图修复BUG■■■■


//■■■■■■■■■■■以下内容为修复功能，永久存在■■■■■■■■■■■■■■■■